In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.3.5'

In [7]:
list_s= [1,2,3,4,5,'data values','Shilpa']
list_s

[1, 2, 3, 4, 5, 'data values', 'Shilpa']

In [8]:
ser_1 = pd.Series(list_s)
ser_1

0              1
1              2
2              3
3              4
4              5
5    data values
6         Shilpa
dtype: object

In [9]:
type(ser_1)

pandas.core.series.Series

In [11]:
ser_2 = pd.Series([1,10,100,1000,10000,'Windy'])
ser_2

0        1
1       10
2      100
3     1000
4    10000
5    Windy
dtype: object

## change index

In [15]:
series3 = pd.Series([1,2,33,44],index=['a','b','c','d'] , dtype='float')
series3

a     1.0
b     2.0
c    33.0
d    44.0
dtype: float64

##

In [17]:
series3 = pd.Series([1,2,33,44],index=['a','b','c','d'] , dtype='float',name='column_name')
series3

a     1.0
b     2.0
c    33.0
d    44.0
Name: column_name, dtype: float64

In [18]:
dict_series = pd.Series({'a':10,'b':20})
dict_series

a    10
b    20
dtype: int64

## access element

In [19]:
series3[2]

33.0

In [20]:
series3[0:3]

a     1.0
b     2.0
c    33.0
Name: column_name, dtype: float64

In [21]:
max(series3)

44.0

In [23]:
series4=pd.Series([20,30,40,50])
series5 = pd.Series([41,42,43,44])

## addition of  Series

In [24]:
series4+ series5

0    61
1    72
2    83
3    94
dtype: int64

## unequal data Values Series

In [25]:
series5+ series3

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [26]:
series3

a     1.0
b     2.0
c    33.0
d    44.0
Name: column_name, dtype: float64

## Create Pandas Dataframe

In [28]:
empty_dataframe= pd.DataFrame()
empty_dataframe

Empty DataFrame
Columns: []
Index: []

In [29]:
lst = ['a','aa','b','bb']

In [31]:
df1 = pd.DataFrame(lst)
df1

    0
0   a
1  aa
2   b
3  bb

In [32]:
ls_of_ls = [[1,2,3],[4,5,6],[9,9,9]]
ls_of_ls

[[1, 2, 3], [4, 5, 6], [9, 9, 9]]

In [34]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  9  9  9

In [35]:
dict = {'ID':[11,22,33,44,55]}

In [37]:
df3 = pd.DataFrame(dict)
df3

   ID
0  11
1  22
2  33
3  44
4  55

In [38]:
dict = {'Id':[33,31,32],'name':['Shilpa','wasim','windy']}

In [40]:
df4 = pd.DataFrame(dict)
df4

   Id    name
0  33  Shilpa
1  31   wasim
2  32   windy

In [41]:
ls_dict = [{'a':100,'b':12},{'a':200,'b':20,'c':99}]

In [42]:
df5 = pd.DataFrame(ls_dict)
df5

     a   b     c
0  100  12   NaN
1  200  20  99.0

In [43]:
dict_sr = {'Id':pd.Series([1,2,3,4]),'SN':pd.Series([60,61,62,63])}
dict_sr

{'Id': 0    1
 1    2
 2    3
 3    4
 dtype: int64,
 'SN': 0    60
 1    61
 2    62
 3    63
 dtype: int64}

In [45]:
df6 = pd.DataFrame(dict_sr)
df6

   Id  SN
0   1  60
1   2  61
2   3  62
3   4  63